read_verilog vexriscv.demo.GenFull.v
synth_xilinx -top vexriscv.demo.GenFull
write_verilog vexriscv.demo.GenFull_netlist.v