set design "$::env(DESIGN_HOME)/vexriscv.demo.GenFull.v"
yosys -import
read_verilog 
synth_xilinx -top "$design"
write_verilog naja_netlist.v
